<!--
паттерн (шаблон) MVC (modal viev contoller)

контроллер - это класс, класс содержит в себе набор методов , которые выполняют задачи пользователя.

модель - для выполнения команды пользователя контроллер обращается к модели. Модель тоже является классом. Этот класс инкапсулирует работу с источником данных, т.е. с БД.
Задача модели: запрашивать, получать данные, из БД

Представление(View) - является веб страницей, Представление не является привязанным к одним и тем же данным и может в разные моменты времени отображать разню информацию.

MVC - примение данного паттерна в приложении позволяет отделить бизнес-логику приложения от ее визуализации

плюсы паттерна MVC
1.повышает переиспользование кода
2.позволяет исключить дублирование
3.сокращет объемы написанного кода
4.делает приложение легко масштабируемым(расширяемым)



-->

